#include "Enemy.h"
#include <stdio.h>

///=============================================================================
///						初期化
void Enemy::Initialize() {
	//---------------------------------------
	// フェーズの初期化
	phase_ = Phase::ACCESS;
}

///=============================================================================
///						更新
void Enemy::Update() {
	//現在のフェーズの関数を実行
	( this->*pStateTable_[static_cast<size_t>( phase_ )] )( );

	//数秒ごとにphase_を変更
	phase_ = static_cast<Phase>( ( static_cast<int>( phase_ ) + 1 ) % 3 );

	//デバック用表示
	printf("phase_ = %d\n", static_cast<int>( phase_ ));

}

///=============================================================================
///						描画
void Enemy::Draw() {
}

///=============================================================================
///						接近
void Enemy::Access() {
	//接近したことをコンソールで表示
	printf("接近\n");
}

///=============================================================================
///						射撃
void Enemy::Fire() {
	//射撃したことをコンソールで表示
	printf("射撃\n");
}

///=============================================================================
///						離脱
void Enemy::Leave() {
	//離脱したことをコンソールで表示
	printf("離脱\n");
}
