/*********************************************************************
 * \file   main.cpp
 * \brief
 *
 * \author Harukichimaru
 * \date   November 2024
 * \note
 *********************************************************************/
#include <stdio.h>
#include <iostream>
#include <Windows.h>
#include <thread>

///=============================================================================
///						MAIN
int main() {
	SetConsoleOutputCP(65001);
	printf("HELLOhello\n");
	printf("丸岡春稀ですよ\n");

	///--------------------------------------------------------------
	///						 変数宣言・初期化

	//========================================
	// スレッド1を作成
	std::thread t1([]() {
		printf("thread1\n");
	});
	// スレッド1の終了を待機
	t1.join();

	//========================================
	// スレッド2を作成
	std::thread t2([]() {
		printf("thread2\n");
	});
	// スレッド2の終了を待機
	t2.join();

	//========================================
	// スレッド3を作成
	std::thread t3([]() {
		printf("thread3\n");
	});
	// スレッド3の終了を待機
	t3.join();

	///--------------------------------------------------------------
	///							処理

	return 0;
}