/*********************************************************************
 * \file   ICommand.h
 * \brief  
 * 
 * \author Harukichimaru
 * \date   December 2024
 * \note   
 *********************************************************************/
#pragma once

///=============================================================================
///						前方宣言
class Player;
///=============================================================================
///						コマンドインターフェース
class ICommand {
	///--------------------------------------------------------------
	///							メンバ関数
public:
	virtual ~ICommand();
	virtual void Execute(Player* player) = 0;
};

///=============================================================================
///						右移動コマンド
class MoveRightCommand : public ICommand {
	///--------------------------------------------------------------
	///							メンバ関数
public:
	void Execute(Player* player) override;
};

///=============================================================================
///						左移動コマンド
class MoveLeftCommand : public ICommand {
	///--------------------------------------------------------------
	///							メンバ関数
	void Execute(Player* player) override;
};